Repository: monogramdesign/firebase-tools-test-apps
Catalog: angular/example-i18n-ssr-app/src/locale/messages.*.xlf
Languages: pl

# welcome.title
source: Welcome to Angular i18n SSR App
pl: Witamy w aplikacji Angular i18n SSR

# nav.english
source: English
pl: Angielski

# hero.subtitle
source: A modern Angular application with internationalization and server-side rendering
pl: Nowoczesna aplikacja Angular z internationalizacją i renderowaniem po stronie serwera

# hero.description
source: This application demonstrates how to implement i18n (internationalization) with SSR (Server-Side Rendering) in Angular, ready for Firebase deployment.
pl: Ta aplikacja demonstruje jak implementować i18n (internationalizację) z SSR (Server-Side Rendering) w Angular, gotową do wdrożenia na Firebase.

# features.title
source: Features
pl: Funkcjonalności

# features.i18n
source: Full internationalization support
pl: Pełne wsparcie dla internationalizacji

# features.ssr
source: Server-side rendering for better SEO
pl: Renderowanie po stronie serwera dla lepszego SEO

# features.firebase
source: Firebase hosting ready
pl: Gotowe do hostingu na Firebase

# features.modern
source: Modern Angular architecture
pl: Nowoczesna architektura Angular

# demo.title
source: i18n Demo
pl: Demo i18n

# demo.current-time
source: Current time: {{ currentTime | date:'medium' }}
pl: Aktualna godzina: {{ currentTime | date:'medium' }}

# demo.increment
source: Increment
pl: Zwiększ

# demo.decrement
source: Decrement
pl: Zmniejsz

# demo.counter
source: Items count: {{ counter }}
pl: Liczba elementów: {{ counter }}

# locale.title
source: Locale Information
pl: Informacje o lokalizacji

# locale.current
source: Current locale: <strong>{{ currentLocale }}</strong>
pl: Aktualna lokalizacja: <strong>{{ currentLocale }}</strong>

# locale.date-format
source: Date format example: {{ currentTime | date:'short' }}
pl: Przykład formatu daty: {{ currentTime | date:'short' }}

# locale.currency-format
source: Currency format example: {{ price | currency:currency:'symbol':'1.2-2' }}
pl: Przykład formatu waluty: {{ price | currency:currency:'symbol':'1.2-2' }}

# footer.copyright
source: © 2024 Angular i18n SSR Example. All rights reserved.
pl: © 2024 Przykład Angular i18n SSR. Wszystkie prawa zastrzeżone.
